In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('tested.csv')

1 .How big is the data?

In [5]:
df.shape

(418, 12)

2. How does ypur data look like?

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

To learn about the whole data have random data

In [10]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
374,1266,1,1,"Dodge, Mrs. Washington (Ruth Vidaver)",female,54.0,1,1,33638,81.8583,A34,S
100,992,1,1,"Stengel, Mrs. Charles Emil Henry (Annie May Mo...",female,43.0,1,0,11778,55.4417,C116,C
337,1229,0,3,"Elias, Mr. Joseph",male,39.0,0,2,2675,7.2292,NaN,C
104,996,1,3,"Thomas, Mrs. Alexander (Thamine Thelma"")""",female,16.0,1,1,2625,8.5167,NaN,C
183,1075,0,3,"Lane, Mr. Patrick",male,NaN,0,0,7935,7.7500,NaN,Q

3. What is the data type of cols?

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [17]:
df['Age'] = df['Age'].round().astype('Int64')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    Int64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: Int64(1), float64(1), int64(5), object(5)
memory usage: 39.7+ KB

4 . Are there missing values?

In [19]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

5 . How does the data look mathematically?

In [21]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.0,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.253012,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.179764,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.0,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.0,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.0,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.0,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.0,8.000000,9.000000,512.329200

6. Are there duplicate values?

In [22]:
df.duplicated().sum()

np.int64(0)

7.How is the correlation between your data?

In [26]:
numeric_df = df.select_dtypes(include=['number'])
correlation_matrix = numeric_df.corr()
print(correlation_matrix)

             PassengerId  Survived    Pclass       Age     SibSp     Parch  \
PassengerId     1.000000 -0.023245 -0.026751 -0.033505  0.003818  0.043080
Survived       -0.023245  1.000000 -0.108615  0.000817  0.099943  0.159120
Pclass         -0.026751 -0.108615  1.000000 -0.492984  0.001087  0.018721
Age            -0.033505  0.000817 -0.492984  1.000000 -0.091769 -0.060817
SibSp           0.003818  0.099943  0.001087 -0.091769  1.000000  0.306895
Parch           0.043080  0.159120  0.018721 -0.060817  0.306895  1.000000
Fare            0.008211  0.191514 -0.577147  0.338061  0.171539  0.230046

                 Fare
PassengerId  0.008211
Survived     0.191514
Pclass      -0.577147
Age          0.338061
SibSp        0.171539
Parch        0.230046
Fare         1.000000